# <center>Pandas Assignment</center>

Import pandas and numpy with their aliases

In [1]:
import pandas as pd

Create a variable a = pd.Series([ 100, 200, 300, 400])

In [2]:
a = pd.Series([100,200,300,400])

Print a, and data type

In [3]:
print(a)
print(a.dtype)

0    100
1    200
2    300
3    400
dtype: int64
int64

Using indexing access the element 300 from the series a.

In [4]:
print(a[2])

300

What are the values of index for series a?

In [5]:
print(a[:])

0    100
1    200
2    300
3    400
dtype: int64

Change the index to  ['c', 'a', 'b', 'd']

In [6]:
a = pd.Series([100,200,300,400],index=['c','a','b','d'])
print(a)

c    100
a    200
b    300
d    400
dtype: int64

Access the value in the series with index 'd'

In [7]:
print(a['d'])

400

Sort the values wrt to the index and print it

In [8]:
a =a.sort_index()
a

a    200
b    300
c    100
d    400
dtype: int64

Create a new Pandas Series b having index as 'e', 'f', and 'g' and value 800,450,100 and print it

In [9]:
b =pd.Series([800,450,100],index=['e','f','g'])
print(b)

e    800
f    450
g    100
dtype: int64

Append b series at the end of a series

In [10]:
#print(a)
#print(b)
a=pd.concat([a,b])
print(a)

a    200
b    300
c    100
d    400
e    800
f    450
g    100
dtype: int64

In [11]:
#print a again after appending b into it
print(a)

a    200
b    300
c    100
d    400
e    800
f    450
g    100
dtype: int64

Sort the values in descending order of a and print the index of the sorted series

In [12]:
desc = a.sort_values(ascending=False).index
desc

Index(['e', 'f', 'd', 'b', 'a', 'c', 'g'], dtype='object')

## Pandas DataFrame

### Part 1

Create a pandas dataframe df from the series 'a' that we used in the last section, print the dataframe

In [13]:
df = pd.DataFrame(a)
df

     0
a  200
b  300
c  100
d  400
e  800
f  450
g  100

In [33]:
df.shape

(7, 1)

What is the shape of the datafarme <br>
(also, what does it imply?)

Hey! remember shape (7,1) implies dataframe has 7 rows and 1 column.

What is the index of the dataframe, is it same as the series 'a'

In [14]:
# yep its same as the series.

print the head and tail of the dataframe. <br>
Additional - (what does head and tali represent?)

In [34]:
df.head()

     0
a  200
b  300
c  100
d  400
e  800

In [35]:
df.columns=['points']

Rename the column of the dataframe as 'points'

In [36]:
df

   points
a     200
b     300
c     100
d     400
e     800
f     450
g     100

Create another Series 'fruits', which contains random names of fruits from ['orange','mango','apple']. The series should contain 7 elements, randomly selected from ['orange','mango','apple']

In [46]:
#Create fruits array
import numpy as np
fruit=['orange','mango','apple']

In [47]:
#Create series fruits out of fruits array
fruits =pd.Series(np.random.choice(fruit,size=7))
fruits

0     apple
1    orange
2     apple
3     apple
4     apple
5     mango
6     mango
dtype: object

Change the index of fruits to the index of dataframe df

In [48]:
fruits.index=['a','b','c','d','e','f','g']
fruits

a     apple
b    orange
c     apple
d     apple
e     apple
f     mango
g     mango
dtype: object

Add this fruits series as a new column to the dataframe df with its column name as 'fruits'
<br>print the head of the dataframe to verify

In [49]:
df['fruits']=fruits

In [50]:

df

   points  fruits
a     200   apple
b     300  orange
c     100   apple
d     400   apple
e     800   apple
f     450   mango
g     100   mango

## Pandas Concatenation

Create a dataframe  d1 where the cols are  ‘city’ : [‘Chandigarh’, ‘Delhi’, ‘Kanpur’, ‘Chennai’, ‘Manali’ ] and ‘Temperature’ : [15, 22, 20, 26,-2]

In [57]:
d1 = pd.DataFrame({'city':['Chandigarh','Delhi', 'Kanpur','Chennai','Manali']
                           ,'Temperature' : [15, 22, 20, 26,-2]})

Print(d1)

In [58]:
print(d1)

         city  Temperature
0  Chandigarh           15
1       Delhi           22
2      Kanpur           20
3     Chennai           26
4      Manali           -2

What is the shape of d1.

In [59]:
d1.shape

(5, 2)

Set city = d1['city']

In [61]:
city=d1['city']

print city <br>
What is the type of city.

In [64]:
print(city)
print(city.dtype)

0    Chandigarh
1         Delhi
2        Kanpur
3       Chennai
4        Manali
Name: city, dtype: object
object

Create another datafeame 'd2' where the columns are <br>
'city' - ['Bengalaru','Coimbatore','Srirangam','Pondicherry'] <br>
'Temperature' - [24,35,36,39]

In [71]:
d2 = pd.DataFrame({'city':['Bengalaru','Coimbatore','Srirangam','Pondicherry'],
'Temperature':[24,35,36,39]})
d2

          city  Temperature
0    Bengalaru           24
1   Coimbatore           35
2    Srirangam           36
3  Pondicherry           39

print the shape of this dataframe

In [72]:
d2.shape

(4, 2)

merge the two dataframes together, save it in a new dataframe named 'd3'

In [77]:
d3=pd.concat([d1,d2])
d3

          city  Temperature
0   Chandigarh           15
1        Delhi           22
2       Kanpur           20
3      Chennai           26
4       Manali           -2
0    Bengalaru           24
1   Coimbatore           35
2    Srirangam           36
3  Pondicherry           39

Select the part of the dataframe such that it contains cities wherer temp is less then or equal to 20 <br>
How many cities are there?

In [80]:
d3[d3['Temperature']<=20][['city']]

         city
0  Chandigarh
2      Kanpur
4      Manali

Select the part of the dataframe such that it contains the cities where tempearature greater than or equal to 35

In [81]:
d3[d3['Temperature']>=35][['city']]

          city
1   Coimbatore
2    Srirangam
3  Pondicherry

## Applying functions to columns and creating new columns

We need to create another column in d3, which contains  a boolean value for each city to indicate whether it's a union territory or not. 
- HINT: Chandigarh, Pondicherry and Delhi are only 3 union territories here.

In [83]:
# write function here

def is_ut(x):
    union_territory=['Chandigarh','Pondicherry','Delhi']
    return x in union_territory
    

    
d3['is_ut'] = d3['city'].apply(is_ut)

In [84]:
# print d3
print(d3)

          city  Temperature  is_ut
0   Chandigarh           15   True
1        Delhi           22   True
2       Kanpur           20  False
3      Chennai           26  False
4       Manali           -2  False
0    Bengalaru           24  False
1   Coimbatore           35  False
2    Srirangam           36  False
3  Pondicherry           39   True

The temperatures mentioned in ‘Temperature’ column are mentioned in Celsius, we need another column which contains the same in Fahrenheit.

HINT - 
- Define a function c_to_f which takes input temp in celsius and returns a value with temperature in Fahrenheit.
- To check: c_to_f(10) should return 50.

In [86]:
# write function here
def c_to_f(temp_c):
    return (temp_c*9/5)+32

In [87]:
# check function c_to_f(10)
print(c_to_f(10))

50.0

In [88]:
# apply function c_to_f to d3 to create a column 'temp_farenhiet'
d3['temp_farenhiet']=d3['Temperature'].apply(c_to_f)
d3

          city  Temperature  is_ut  temp_farenhiet
0   Chandigarh           15   True            59.0
1        Delhi           22   True            71.6
2       Kanpur           20  False            68.0
3      Chennai           26  False            78.8
4       Manali           -2  False            28.4
0    Bengalaru           24  False            75.2
1   Coimbatore           35  False            95.0
2    Srirangam           36  False            96.8
3  Pondicherry           39   True           102.2

## Indexing and selecting rows in DataFrame

Select subset of the dataframe d1 such that it contains the cities which are union territories.

In [93]:
d1=d1[['city']==[d3['is_ut']=='True']]

ValueError: The truth value of a Series is ambiguous. Use a.empty, a.bool(), a.item(), a.any() or a.all().

Select a subset of the dataframe d1 such that it contains the cities which only have temperature above 90 Farenhiet.

Select only the first three rows of the dataframe d1.

Select all the rows and last two columns in the dataframe.

## Groupby

In [96]:
# Create a dataframe using dictionary of your choice

data = pd.DataFrame({
    'Name' : ['Ankit', 'Aishwarya', 'Sanket', 'Shivangi', 'Saiprasad', 'Rishika', 'Pratiksha'],
    'salary' : [2300, 2100, 2200, 2100, 2200, 2100, 2000],
    'University' : ['BHU', 'JNU', 'DU', 'BHU', 'SPPU', 'SPPU', 'DU'],
})
data

        Name  salary University
0      Ankit    2300        BHU
1  Aishwarya    2100        JNU
2     Sanket    2200         DU
3   Shivangi    2100        BHU
4  Saiprasad    2200       SPPU
5    Rishika    2100       SPPU
6  Pratiksha    2000         DU

In [101]:
# Use Groupby of single column with aggregate sum()
University=data.groupby('University')
bhu=University.get_group('BHU')
bhu['salary'].sum()

4400

In [102]:
# Use Groupby of single column with aggregate count()
jnu=University.get_group('JNU')
jnu['salary'].count()

1

In [108]:
# Use Groupby of single column with aggregate min() and max()
du=University.get_group('DU')
min=du['salary'].min()
print(min)
max=du['salary'].max()
print(max)

2000
2200

In [29]:
# Use Groupby of any 2 columns with aggregate mean()

In [30]:
# Use Groupby of any 2 columns with aggregate min() and max()

## Data Range

Create a pandas daterange where starting date is 1st of January,2020 and end date is 1st of April 2021, store it in a new variable named 'a'

In [31]:
# a =

print a

What is the len of a?

What is the type of a?